import "./chunk-3OV72XIM.js";

// node_modules/@angular/common/locales/extra/ar.js
var ar_default = [[["فجرًا", "صباحًا", "ظهرًا", "بعد الظهر", "مساءً", "منتصف الليل", "ليلاً"], ["فجرًا", "ص", "ظهرًا", "بعد الظهر", "مساءً", "في المساء", "ليلاً"], ["في الصباح", "صباحًا", "ظهرًا", "بعد الظهر", "مساءً", "في المساء", "ليلاً"]], [["فجرًا", "صباحًا", "ظهرًا", "بعد الظهر", "مساءً", "منتصف الليل", "ليلاً"], ["فجرًا", "ص", "ظهرًا", "بعد الظهر", "مساءً", "منتصف الليل", "ليلاً"], ["فجرًا", "صباحًا", "ظهرًا", "بعد الظهر", "مساءً", "منتصف الليل", "ليلاً"]], [["03:00", "06:00"], ["06:00", "12:00"], ["12:00", "13:00"], ["13:00", "18:00"], ["18:00", "24:00"], ["00:00", "01:00"], ["01:00", "03:00"]]];
export {
  ar_default as default
};
//# sourceMappingURL=@angular_common_locales_extra_ar.js.map
